/******************************************************************************/
/*                                                                            */
/* src/Buffer.h                                                               */
/*                                                                 2019/08/28 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef BUFFER_H
#define BUFFER_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>
#include <stdint.h>

/* モジュール内ヘッダ */
#include "ns16550.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* バッファID */
#define BUFFER_ID_RECEIVE  ( 0 )    /**< 受信バッファ     */
#define BUFFER_ID_TRANSMIT ( 1 )    /**< 転送バッファ     */
#define BUFFER_ID_MIN      ( 0 )    /**< バッファID最小値 */
#define BUFFER_ID_MAX      ( 1 )    /**< バッファID最大値 */
#define BUFFER_ID_NUM      ( 2 )    /**< バッファ数       */

/** バッファID */
typedef int BufferId_t;


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* バッファ管理初期化 */
extern void BufferInit( void );
/* バッファ読込み */
extern bool BufferRead( NS16550ComNo_t comNo,
                        BufferId_t     id,
                        uint8_t        *pValue );
/* バッファ書込み */
extern void BufferWrite( NS16550ComNo_t comNo,
                         BufferId_t     id,
                         uint8_t        value  );


/******************************************************************************/
#endif
