/******************************************************************************/
/*                                                                            */
/* src/Bufmng.h                                                               */
/*                                                                 2020/07/18 */
/* Copyright (C) 2019-2020 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
#ifndef BUFMNG_H
#define BUFMNG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stddef.h>
#include <stdint.h>

/* モジュール内ヘッダ */
#include "ns16550.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* バッファID */
#define BUFMNG_ID_RX  ( 0 ) /**< 受信バッファ     */
#define BUFMNG_ID_TX  ( 1 ) /**< 転送バッファ     */
#define BUFMNG_ID_MIN ( 0 ) /**< バッファID最小値 */
#define BUFMNG_ID_MAX ( 1 ) /**< バッファID最大値 */
#define BUFMNG_ID_NUM ( 2 ) /**< バッファ数       */

/** バッファID */
typedef int BufmngId_t;


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* バッファクリア */
extern void BufmngClear( NS16550ComNo_t comNo,
                         BufmngId_t     id     );
/* バッファ管理初期化 */
extern void BufmngInit( void );
/* バッファ読込み */
extern size_t BufmngRead( NS16550ComNo_t comNo,
                          BufmngId_t     id,
                          uint8_t        *pData,
                          size_t         size    );
/* バッファ書込み */
extern size_t BufmngWrite( NS16550ComNo_t comNo,
                           BufmngId_t     id,
                           uint8_t        *pData,
                           size_t         size    );


/******************************************************************************/
#endif
