/******************************************************************************/
/*                                                                            */
/* src/config.h                                                               */
/*                                                                 2020/07/18 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef CONFIG_H
#define CONFIG_H
/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* ファイルパス */
#define CONFIG_FILEPATH_SERIAL1 ( "/serial1" )  /**< serial1用ファイルパス */
#define CONFIG_FILEPATH_SERIAL2 ( "/serial2" )  /**< serial2用ファイルパス */

/** 割込み管理スレッド用スタックサイズ */
#define CONFIG_STACK_SIZE ( 4096 )

/** 転送/受信バッファサイズ */
#define CONFIG_BUFFER_SIZE ( 4096 )


/******************************************************************************/
#endif
