/******************************************************************************/
/*                                                                            */
/* src/main.c                                                                 */
/*                                                                 2019/04/08 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>

/* ライブラリヘッダ */
#include <libMk.h>
#include <libmlog.h>
#include <libmvfs.h>


/******************************************************************************/
/* ローカル関数宣言                                                           */
/******************************************************************************/
/* メインループ */
static void Loop( void );


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       drv-ns16550メイン関数
 * @details     メインループを起動する。
 */
/******************************************************************************/
void main( void )
{
    int32_t ret;    /* 戻り値 */

    /* 割込み割当て */
    ret = MkIntStartMonitoring( MK_INT_IRQ3, NULL );

    /* 割当て結果判定 */
    if ( ret != MK_INT_RET_SUCCESS ) {
        /* 失敗 */

        /* TODO */
    }

    /* 割込み割当て */
    ret = MkIntStartMonitoring( MK_INT_IRQ4, NULL );

    /* 割当て結果判定 */
    if ( ret != MK_INT_RET_SUCCESS ) {
        /* 失敗 */

        /* TODO */
    }

    /* 割込み有効化 */
    ret = MkIntEnable( MK_INT_IRQ4, NULL );

    /* 有効化結果判定 */
    if ( ret != MK_INT_RET_SUCCESS ) {
        /* 失敗 */

        /* TODO */
    }

    /* 割込み有効化 */
    ret = MkIntEnable( MK_INT_IRQ3, NULL );

    /* 有効化結果判定 */
    if ( ret != MK_INT_RET_SUCCESS ) {
        /* 失敗 */

        /* TODO */
    }

    /* メインループ */
    Loop();

    return;
}


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       メインループ
 * @details     TODO
 */
/******************************************************************************/
static void Loop( void )
{
    LibMlogPut( "[drv-ns16550][%s:%d] drv-ns16550 start!", __FILE__, __LINE__ );

    LibMlogPut( "[drv-ns16550][%s:%d] mount start!", __FILE__, __LINE__ );
    LibMvfsMount( "/serial" );
    LibMlogPut( "[drv-ns16550][%s:%d] mount end!", __FILE__, __LINE__ );

    /* ループ */
    while ( true ) {
        MkTimerSleep( 1000, NULL );
    }

    return;
}


/******************************************************************************/
