/******************************************************************************/
/*                                                                            */
/* src/main.c                                                                 */
/*                                                                 2020/07/19 */
/* Copyright (C) 2019-2020 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* モジュール内ヘッダ */
#include "Bufmng.h"
#include "Debug.h"
#include "Filemng.h"
#include "Ioctrl.h"
#include "Intmng.h"
#include "Rxctrl.h"
#include "Txctrl.h"


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       drv-ns16550メイン関数
 * @details     各モジュールを初期化し、デバイスファイル操作要求を待ち合わせる。
 */
/******************************************************************************/
void main( void )
{
    DEBUG_LOG_TRC( "drv-ns16550 start!" );

    /* 入出力制御初期化 */
    IoctrlInit();

    /* バッファ管理初期化 */
    BufmngInit();

    /* 受信制御初期化 */
    RxctrlInit();

    /* 転送制御初期化 */
    TxctrlInit();

    /* デバイスファイル管理初期化 */
    FilemngInit();

    /* 割込み管理初期化 */
    IntmngInit();

    /* デバイスファイル操作要求待ち合わせ */
    FilemngWaitRequest();

    /* TODO */
    DEBUG_ABORT();
}


/******************************************************************************/
