/******************************************************************************/
/*                                                                            */
/* src/msg.h                                                                  */
/*                                                                 2019/08/28 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef MSG_H
#define MSG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>

/* モジュール内ヘッダ */
#include "ns16550.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** メッセージID */
typedef uint32_t MsgId_t;

#define MSG_ID_TXREQ         ( 1 )  /**< 転送要求メッセージ       */
#define MSG_ID_TXBUFFEREMPTY ( 2 )  /**< 転送バッファ空メッセージ */
#define MSG_ID_RXNTC         ( 3 )  /**< 受信通知メッセージ       */

/** メッセージ種別 */
typedef uint32_t MsgType_t;

#define MSG_TYPE_NTC ( 1 )  /**< 通知タイプ */
#define MSG_TYPE_REQ ( 2 )  /**< 要求タイプ */
#define MSG_TYPE_RES ( 3 )  /**< 応答タイプ */

/** メッセージヘッダ */
typedef struct {
    MsgId_t   msgId;    /**< メッセージID     */
    MsgType_t type;     /**< メッセージ種別   */
    uint32_t  seqNo;    /**< シーケンス番号   */
} MsgHdr_t;

/** 転送バッファ空メッセージ */
typedef struct {
    MsgHdr_t       header;  /**< メッセージヘッダ */
    NS16550ComNo_t comNo;   /**< COM番号          */
} MsgTxBufferEmpty_t;

/** 転送要求メッセージ */
typedef struct {
    MsgHdr_t       header;  /**< メッセージヘッダ */
    NS16550ComNo_t comNo;   /**< COM番号          */
} MsgTxReq_t;

/** 受信通知メッセージ */
typedef struct {
    MsgHdr_t       header;  /**< メッセージヘッダ */
    NS16550ComNo_t comNo;   /**< COM番号          */
} MsgRxNtc_t;


/******************************************************************************/
#endif
