/******************************************************************************/
/*                                                                            */
/* src/Rxctrl.c                                                               */
/*                                                                 2020/07/18 */
/* Copyright (C) 2019-2020 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>
#include <stdint.h>

/* モジュール内ヘッダ */
#include "ns16550.h"
#include "Bufmng.h"
#include "Debug.h"
#include "Filemng.h"
#include "Ioctrl.h"
#include "Rxctrl.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** LSRマスク(エラー) */
#define LSR_MASK_ERR \
    ( NS16550_LSR_BI | NS16550_LSR_FE | NS16550_LSR_PE | NS16550_LSR_OE )
/** LSRマスク(エラー&データ) */
#define LSR_MASK_ERR_DR \
    ( LSR_MASK_ERR | NS16550_LSR_DR )


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       受信
 * @details     デバイスの受信バッファからデータを読み込む。読み込んだデータは
 *              デバイスのステータスに応じてドライバ内受信バッファへの追加また
 *              は破棄をする。ドライバ内受信バッファに1度でもデータを追加した場
 *              合は、読込レディ通知を行う。
 *
 * @param[in]   comNo デバイス識別番号
 *                  - NS16550_COM1 COM1
 *                  - NS16550_COM2 COM2
 */
/******************************************************************************/
void RxctrlDo( NS16550ComNo_t comNo )
{
    bool    write;  /* バッファ追加有無 */
    uint8_t lsr;    /* ステータス       */
    uint8_t rbr;    /* 受信データ       */

    /* 初期化 */
    write = false;
    lsr   = 0;
    rbr   = 0;

    /* ステータス読込み */
    lsr = IoctrlInLSR( comNo );

    /* 受信データまたはエラーが無くなるまで繰り返し */
    while ( ( lsr & LSR_MASK_ERR_DR ) != 0 ) {
        /* 受信バッファ読込み */
        rbr = IoctrlInRBR( comNo );

        /* ステータス判定 */
        if ( ( lsr & LSR_MASK_ERR ) == 0 ) {
            /* エラー無し */

            /* バッファ追加 */
            BufmngWrite( comNo, BUFMNG_ID_RX, &rbr, 1 );
            write = true;
        }

        /* ステータス読込み */
        lsr = IoctrlInLSR( comNo );
    }

    /* バッファ追加判定 */
    if ( write != false ) {
        /* バッファ追加済 */

        /* 読込レディ状態更新 */
        FilemngUpdateReadyRead( comNo );
    }

    return;
}


/******************************************************************************/
/**
 * @brief       受信制御初期化
 * @details     処理なし。
 */
/******************************************************************************/
void RxctrlInit( void )
{
    return;
}


/******************************************************************************/
